//一些整型数据在内存中存储的案例
//#1
#include <stdio.h>
int main()
{
    char a= -1;
    //10000000 00000000 00000000 00000001
    //11111111 11111111 11111111 11111110
    //11111111 11111111 11111111 11111111
    //11111111
    signed char b=-1;
    //11111111 
    unsigned char c=-1;
    //11111111
    //整型提升
    //11111111 11111111 11111111 11111111 ---- -1
    //00000000 00000000 00000000 11111111 ---- 255
    printf("a=%d,b=%d,c=%d",a,b,c);
    return 0;
}//a=-1,b=-1,c=255



//#2
#include <stdio.h>
int main()
{
    char a = -128;
    //10000000 00000000 00000000 10000000
    //11111111 11111111 11111111 01111111
    //11111111 11111111 11111111 10000000
    //10000000
    //整型提升
    //11111111 11111111 11111111 10000000  -直接当作无符号数打印
    printf("%u\n",a);//4294967168
    return 0;
}




//#3
#include <stdio.h>
int main()
{
    char a = 128;
    //00000000 00000000 00000000 10000000
    //10000000
    // 整型提升
    //11111111 11111111 11111111 10000000
    //当作无符号数打印
    printf("%u\n",a);//4294967168
    return 0;
}



//#4
#include <stdio.h>
int main()
{
    int i = -20;
    //10000000 00000000 00000000 00010100
    //11111111 11111111 11111111 11101011
    //11111111 11111111 11111111 11101100
    unsigned int j = 10;
    //00000000 00000000 00000000 00001010

    //i+j
    //11111111 11111111 11111111 11101100
    //00000000 00000000 00000000 00001010
    //11111111 11111111 11111111 11110110
    //11111111 11111111 11111111 11110101
    //10000000 00000000 00000000 00001010  --  -10
    printf("%d\n", i + j);
    //按照补码的形式进行运算，最后格式化成为有符号整数
    return 0;
}



//#5
#include <stdio.h>
#include <Windows.h>
int main()
{
    unsigned int i;
    for (i = 9; i >= 0; i--)
    {
        printf("%u\n", i);
        Sleep(100);
    }
    return 0;
}//死循环，由于减到-1时为无符号数---->很大的值



//#6
#include <stdio.h>
int main()
{
    char a[1000];
    int i;
    for (i = 0; i < 1000; i++)
    {
        a[i] = -1 - i;
    }
    printf("%d", strlen(a));//255

    return 0;
}//-1 -2 -3 ...-128 127 126 ...3 2 1 0  strlen遇到0结束计数
//-128~127
//128+127=255



//#7
#include <stdio.h>
unsigned char i = 0;
int main()
{
    for (i = 0; i <= 255; i++)
    {
        printf("hello world\n");
    }
    return 0;
}//由于unsigned char i >=0 死循环